In [218]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
!pip install sqlalchemy
import pymysql
from sqlalchemy import create_engine

Requirement already satisfied: sqlalchemy in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (1.3.10)

In [219]:
engine = create_engine('sqlite:////Users/Stefania/downloads/stefaniabraca.db')

In [220]:
query = "select * from personal_info"
dfpersonal_info = pd.read_sql_query(query, engine)
query = "select * from business_info"
dfbusiness_info = pd.read_sql_query(query, engine)
query = "select * from rank_info"
dfrank_info = pd.read_sql_query(query, engine)

# Merge Tables To Build DF

In [221]:
def get_main_data(df1, df2, df3):
    merged_df = df1.merge(df2, on='id')
    final_df = merged_df.merge(df3, on='id')
    return final_df

In [222]:
#variable
final_df = get_main_data(dfrank_info, dfbusiness_info, dfpersonal_info)
final_df

,id,name,position,Unnamed: 0_x,Unnamed: 0_y,Source,worth,worthChange,realTimeWorth,realTimePosition,lastName,age,Unnamed: 0,gender,country,image
0,5227,jeff BEZos,1.0,52,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1,bEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,2642,bill GATES,2.0,53,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2,GATES,62 years old,53,M,None,https://specials-images.forbesimg.com/imageser...
2,5422,warrEN BUFFEtt,3.0,54,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8183,bernarD ARNAULT,4.0,55,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4,aRNAULt,69 years old,55,M,France,https://specials-images.forbesimg.com/imageser...
4,5642,mark zUCKERBerg,5.0,56,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5,zuckeRBERG,1985,56,M,USA,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,zHAO XIAOQIANG,2204.0,2255,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134,zhAO,51 years old,2255,None,China,https://specials-images.forbesimg.com/imageser...
2204,1310,zhOU LIANGZHang,2205.0,2256,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134,zhOU,55 years old,2256,M,China,https://specials-images.forbesimg.com/imageser...
2205,4488,zhu XINGMING,2206.0,2257,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856,zHU,51 years old,2257,M,None,https://specials-images.forbesimg.com/imageser...
2206,7152,ZHUO JUn,2207.0,2258,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978,zhUO,52 years old,2258,Female,Hong Kong,https://specials-images.forbesimg.com/imageser...
2207,7214,OLGUN ZORlu,2208.0,2259,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978,zORLU,54 years old,2259,None,Turkey,https://specials-images.forbesimg.com/imageser...

# Drop Columns

In [223]:
def drop(df, list_col_todrop):
    # drop
    df.drop(list_col_todrop, axis=1, inplace=True)
    
    #cols = list(final_df.columns.values)
    #cols = ['id', 'name', 'lastName', 'position', 'worth', 'Source', 'age', 'gender', 'country', 'image']
    #final_df = final_df.reindex(columns=cols)
    return df

In [224]:
#variable
col_todrop = ['worthChange', 'Unnamed: 0_x', 'Unnamed: 0_y', 'realTimeWorth', 'realTimePosition', 'Unnamed: 0', 'image']
#function "drop"
final_df = drop(final_df, col_todrop)

## Separate 'name' Column

In [225]:
def new_name (df):
    col=df["name"].str.split(" ", n = 1, expand = True) 
    df["First Name"]= col[0]
    df["Last Name"]= col[1] 
    return df

In [226]:
new_name(final_df)

,id,name,position,Source,worth,lastName,age,gender,country,First Name,Last Name
0,5227,jeff BEZos,1.0,Technology ==> Amazon,112.0 BUSD,bEZOS,54 years old,None,United States,jeff,BEZos
1,2642,bill GATES,2.0,Technology ==> Microsoft,90.0 BUSD,GATES,62 years old,M,None,bill,GATES
2,5422,warrEN BUFFEtt,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,bufFETT,87 years old,M,None,warrEN,BUFFEtt
3,8183,bernarD ARNAULT,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,aRNAULt,69 years old,M,France,bernarD,ARNAULT
4,5642,mark zUCKERBerg,5.0,Technology ==> Facebook,71.0 BUSD,zuckeRBERG,1985,M,USA,mark,zUCKERBerg
...,...,...,...,...,...,...,...,...,...,...,...
2203,7670,zHAO XIAOQIANG,2204.0,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,zhAO,51 years old,None,China,zHAO,XIAOQIANG
2204,1310,zhOU LIANGZHang,2205.0,Manufacturing ==> electrical equipment,1.0 BUSD,zhOU,55 years old,M,China,zhOU,LIANGZHang
2205,4488,zhu XINGMING,2206.0,Manufacturing ==> electrical equipment,1.0 BUSD,zHU,51 years old,M,None,zhu,XINGMING
2206,7152,ZHUO JUn,2207.0,Manufacturing ==> printed circuit boards,1.0 BUSD,zhUO,52 years old,Female,Hong Kong,ZHUO,JUn
2207,7214,OLGUN ZORlu,2208.0,Diversified ==> diversified,1.0 BUSD,zORLU,54 years old,None,Turkey,OLGUN,ZORlu

In [227]:
def format_data(df): 

    for i in range(df.shape[0]): 
        df.iat[i, 1]= df.iat[i, 1].strip().capitalize() 
        df.iat[i, 5]= df.iat[i, 5].strip().capitalize()
        df.iat[i, 9]= df.iat[i, 9].strip().capitalize() 
  

format_data(final_df) 
final_df.head()

,id,name,position,Source,worth,lastName,age,gender,country,First Name,Last Name
0,5227,Jeff bezos,1.0,Technology ==> Amazon,112.0 BUSD,Bezos,54 years old,None,United States,Jeff,BEZos
1,2642,Bill gates,2.0,Technology ==> Microsoft,90.0 BUSD,Gates,62 years old,M,None,Bill,GATES
2,5422,Warren buffett,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,Buffett,87 years old,M,None,Warren,BUFFEtt
3,8183,Bernard arnault,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,Arnault,69 years old,M,France,Bernard,ARNAULT
4,5642,Mark zuckerberg,5.0,Technology ==> Facebook,71.0 BUSD,Zuckerberg,1985,M,USA,Mark,zUCKERBerg

# Drop Columns

In [228]:
name_drop = ['name', 'Last Name', 'id' ]

In [229]:
final_df = drop(final_df, name_drop)

In [230]:
final_df.head()

,position,Source,worth,lastName,age,gender,country,First Name
0,1.0,Technology ==> Amazon,112.0 BUSD,Bezos,54 years old,None,United States,Jeff
1,2.0,Technology ==> Microsoft,90.0 BUSD,Gates,62 years old,M,None,Bill
2,3.0,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,Buffett,87 years old,M,None,Warren
3,4.0,Fashion & Retail ==> LVMH,72.0 BUSD,Arnault,69 years old,M,France,Bernard
4,5.0,Technology ==> Facebook,71.0 BUSD,Zuckerberg,1985,M,USA,Mark

# Re-indexing Columns

In [231]:
reindex_col = ['position', 'worth', 'First Name', 'lastName', 'age', 'gender', 'Source', 'country']

In [232]:
def reindex (df, list):
    df = df.reindex(columns=list)
    newlist = [w.title() for w in list]
    df.columns = newlist
    return df

# (Javi's Pipeline)

In [233]:
#def loquesea (x):    
#    e = reindex(x)
#    y = hola(e)

In [234]:
final_df = reindex(final_df, reindex_col)

# Gender

In [235]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', None, 'Female'], dtype=object)

In [236]:
null_cols = final_df.isnull().sum()
null_cols
null_cols[null_cols > 0]

Age       65
Gender    13
dtype: int64

In [237]:
null_displ = final_df[(final_df['Gender'].isnull()==True)]

In [238]:
null_displ

,Position,Worth,First Name,Lastname,Age,Gender,Source,Country
26,27.0,29.8 BUSD,Beate,Albrecht jr.,66 years old,None,Fashion & Retail ==> supermarkets,Germany
163,164.0,9.3 BUSD,Gianluigi,Aponte,77 years old,None,Logistics ==> Shipping,None
224,225.0,7.1 BUSD,Willi,Liebherr,None,None,Construction & Engineering ==> Construction,None
309,310.0,5.8 BUSD,Tom,Love,81 years old,None,Fashion & Retail ==> retail & gas stations,USA
426,427.0,4.8 BUSD,Philip,Green,66 years old,None,Fashion & Retail ==> fashion retail,None
529,530.0,4.1 BUSD,Jack,Dangermond,72 years old,None,Technology ==> mapping software,None
581,582.0,3.9 BUSD,Stewart,Resnick,None,None,"Food and Beverage ==> agriculture, water",None
596,597.0,3.8 BUSD,Dominika,Kulczyk,None,None,Finance and Investments ==> diversified,None
731,732.0,3.2 BUSD,Andrew,Cherng,None,None,Food and Beverage ==> restaurants,None
766,767.0,3.1 BUSD,Do,Chang,62 years old,None,Fashion & Retail ==> fashion retail,None
1197,1198.0,2.1 BUSD,Ong,Ong beng seng,73 years old,None,Diversified ==> diversified,None
1260,1261.0,2.0 BUSD,Chuchat,Petaumpai,65 years old,None,Finance and Investments ==> motorcycle loans,None
1290,1291.0,1.9 BUSD,Jean-paul,Clozel,None,None,Healthcare ==> pharmaceuticals,Switzerland

In [239]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', None, 'Female'], dtype=object)

In [240]:
final_df.isnull().sum(axis = 0)

Position       0
Worth          0
First Name     0
Lastname       0
Age           65
Gender        13
Source         0
Country        0
dtype: int64

In [241]:
#13 gender Nulls (NaN) index 26 and 596 are female

In [242]:
#final_df.loc[26, 'Gender']='Female'
#display(final_df.loc[26, 'Gender'])

In [243]:
#final_df.loc[596, 'Gender']='Female'
#display(final_df.loc[596, 'Gender'])

In [244]:
#11 (rest) Gender NaN are Male

In [245]:
#final_df["Gender"].fillna("Male", inplace = True)

In [246]:
def gender (df):
    df.loc[26, 'Gender']='Female'
    df.loc[596, 'Gender']='Female'
    df["Gender"].fillna("Male", inplace = True) 
    df.astype({'Gender': str}).dtypes
    return df

In [247]:
gender(final_df)

,Position,Worth,First Name,Lastname,Age,Gender,Source,Country
0,1.0,112.0 BUSD,Jeff,Bezos,54 years old,None,Technology ==> Amazon,United States
1,2.0,90.0 BUSD,Bill,Gates,62 years old,M,Technology ==> Microsoft,None
2,3.0,84.0 BUSD,Warren,Buffett,87 years old,M,Finance and Investments ==> Berkshire Hathaway,None
3,4.0,72.0 BUSD,Bernard,Arnault,69 years old,M,Fashion & Retail ==> LVMH,France
4,5.0,71.0 BUSD,Mark,Zuckerberg,1985,M,Technology ==> Facebook,USA
...,...,...,...,...,...,...,...,...
2203,2204.0,1.0 BUSD,Zhao,Zhao,51 years old,None,"Fashion & Retail ==> fashion, entertainment",China
2204,2205.0,1.0 BUSD,Zhou,Zhou,55 years old,M,Manufacturing ==> electrical equipment,China
2205,2206.0,1.0 BUSD,Zhu,Zhu,51 years old,M,Manufacturing ==> electrical equipment,None
2206,2207.0,1.0 BUSD,Zhuo,Zhuo,52 years old,Female,Manufacturing ==> printed circuit boards,Hong Kong
2207,2208.0,1.0 BUSD,Olgun,Zorlu,54 years old,None,Diversified ==> diversified,Turkey

In [248]:
final_df.Gender.unique()

array(['None', 'M', 'Male', 'F', 'Female'], dtype=object)

In [249]:
def gender_cat (df):
    df.loc[df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'
    df.loc[df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'
    df[['Gender_cat']] = df[['Gender_cat']].fillna('Not Available')
    df.drop('Gender', axis=1, inplace=True)
    
    return df

In [250]:
#Gender Value=M to Male
#final_df.loc[final_df['Gender'].str.startswith('M'), 'Gender_cat'] = 'Male'

In [251]:
#Gender Value=F to Female
#final_df.loc[final_df['Gender'].str.startswith('F'), 'Gender_cat'] = 'Female'

In [252]:
#Gender Value nan
#null_displ = final_df[(final_df['Gender_cat'].isnull()==True)]

In [253]:
#Gender Value nana to Not Available
#final_df[['Gender_cat']] = final_df[['Gender_cat']].fillna('Not Available')

In [254]:
gender_cat(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1.0,112.0 BUSD,Jeff,Bezos,54 years old,Technology ==> Amazon,United States,Not Available
1,2.0,90.0 BUSD,Bill,Gates,62 years old,Technology ==> Microsoft,None,Male
2,3.0,84.0 BUSD,Warren,Buffett,87 years old,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4.0,72.0 BUSD,Bernard,Arnault,69 years old,Fashion & Retail ==> LVMH,France,Male
4,5.0,71.0 BUSD,Mark,Zuckerberg,1985,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204.0,1.0 BUSD,Zhao,Zhao,51 years old,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205.0,1.0 BUSD,Zhou,Zhou,55 years old,Manufacturing ==> electrical equipment,China,Male
2205,2206.0,1.0 BUSD,Zhu,Zhu,51 years old,Manufacturing ==> electrical equipment,None,Male
2206,2207.0,1.0 BUSD,Zhuo,Zhuo,52 years old,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208.0,1.0 BUSD,Olgun,Zorlu,54 years old,Diversified ==> diversified,Turkey,Not Available

# POSITION to INT

In [255]:
final_df.Position = final_df.Position.astype(int)

In [256]:
final_df

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54 years old,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62 years old,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87 years old,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69 years old,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,1985,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51 years old,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55 years old,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51 years old,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52 years old,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54 years old,Diversified ==> diversified,Turkey,Not Available

In [257]:
final_df.dtypes

Position       int64
Worth         object
First Name    object
Lastname      object
Age           object
Source        object
Country       object
Gender_cat    object
dtype: object

# Age Column

In [258]:
final_df.Age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old',
       None, '72 years old', '48 years old', '77 years old',
       '86 years old', '57 years old', '1988', '55 years old',
       '94 years old', '47 years old', '71 years old', '92 years old',
       '88 years old', '85 years old', '49 years old', '51 years old',
       '50 years old', '43 years old', '42 years old', '91 years old',
       '58 years old', '1984', '38 years old', '1982', '95 years old',
       '39 years old', '41 years old', '40 years old', '1990', '1991',
       '97 years old', '1986', '99 years old', '1994', '1998', '1996',
       '96 years old', '1987', '1989', '1992'], dtype=object)

In [259]:
def clean_age (df):
    df = df['Age'].str.replace('years old', '')
    df[['Age']] = df[['Age']].fillna(0)

In [260]:
#final_df.Age.unique()

In [261]:
#1
final_df['Age'] = final_df['Age'].str.replace('years old', '')
#nans are back

In [262]:
#2
final_df[['Age']] = final_df[['Age']].fillna(0)

In [263]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '1985', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '1983', '65 ', '83 ', '67 ', '75 ', '89 ', 0,
       '72 ', '48 ', '77 ', '86 ', '57 ', '1988', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '1984', '38 ', '1982', '95 ', '39 ', '41 ', '40 ',
       '1990', '1991', '97 ', '1986', '99 ', '1994', '1998', '1996',
       '96 ', '1987', '1989', '1992'], dtype=object)

In [264]:
#def year_toage (series):
 #   if len(x) > 3 lambda x: 2018-x

In [265]:
def year_toage (df):
    df['Age'] = df['Age'].str.replace('1982', '36')
    df['Age'] = df['Age'].str.replace('1983', '35')
    df['Age'] = df['Age'].str.replace('1984', '34')
    df['Age'] = df['Age'].str.replace('1985', '33')
    df['Age'] = df['Age'].str.replace('1986', '32')
    df['Age'] = df['Age'].str.replace('1987', '31')
    df['Age'] = df['Age'].str.replace('1988', '30')
    df['Age'] = df['Age'].str.replace('1989', '29')
    df['Age'] = df['Age'].str.replace('1990', '28')
    df['Age'] = df['Age'].str.replace('1991', '27')
    df['Age'] = df['Age'].str.replace('1992', '26')
    df['Age'] = df['Age'].str.replace('1994', '24')
    df['Age'] = df['Age'].str.replace('1996', '22')
    df['Age'] = df['Age'].str.replace('1998', '20')
    return df

In [266]:
year_toage (final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

In [267]:
final_df.Age.unique()

array(['54 ', '62 ', '87 ', '69 ', '33', '82 ', '78 ', '73 ', '76 ',
       '45 ', '44 ', '70 ', '68 ', '46 ', '64 ', '61 ', '53 ', '84 ',
       '90 ', '59 ', '63 ', '66 ', '80 ', '81 ', '56 ', '79 ', '74 ',
       '60 ', '93 ', '52 ', '35', '65 ', '83 ', '67 ', '75 ', '89 ', nan,
       '72 ', '48 ', '77 ', '86 ', '57 ', '30', '55 ', '94 ', '47 ',
       '71 ', '92 ', '88 ', '85 ', '49 ', '51 ', '50 ', '43 ', '42 ',
       '91 ', '58 ', '34', '38 ', '36', '95 ', '39 ', '41 ', '40 ', '28',
       '27', '97 ', '32', '99 ', '24', '20', '22', '96 ', '31', '29',
       '26'], dtype=object)

In [268]:
def nan_toage (df):
    df[['Age']] = df[['Age']].fillna(0)
    df.Age = df.Age.astype(int)
    mean= df['Age'].mean()
    df.replace({'Age': {0: 'mean'}})
    return df

In [269]:
nan_toage(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,USA,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

In [270]:
final_df.Age.unique()

array([54, 62, 87, 69, 33, 82, 78, 73, 76, 45, 44, 70, 68, 46, 64, 61, 53,
       84, 90, 59, 63, 66, 80, 81, 56, 79, 74, 60, 93, 52, 35, 65, 83, 67,
       75, 89,  0, 72, 48, 77, 86, 57, 30, 55, 94, 47, 71, 92, 88, 85, 49,
       51, 50, 43, 42, 91, 58, 34, 38, 36, 95, 39, 41, 40, 28, 27, 97, 32,
       99, 24, 20, 22, 96, 31, 29, 26])

# COUNTRY Column

In [271]:
final_df.Country.unique()

array(['United States', 'None', 'France', 'USA', 'Mexico',
       "People's Republic of China", 'Hong Kong', 'Germany', 'Canada',
       'China', 'Russia', 'South Korea', 'Ireland', 'Indonesia',
       'Australia', 'Czech Republic', 'India', 'Brazil', 'Italy',
       'New Zealand', 'Israel', 'Switzerland', 'Austria', 'Sweden',
       'Cyprus', 'Spain', 'Norway', 'United Kingdom',
       'United Arab Emirates', 'Philippines', 'Denmark', 'Netherlands',
       'Portugal', 'Japan', 'Swaziland', 'Vietnam', 'Thailand', 'Oman',
       'UK', 'Colombia', 'Malaysia', 'Kazakhstan', 'Poland', 'Singapore',
       'Greece', 'Chile', 'Taiwan', 'Turkey', 'South Africa', 'Angola',
       'Guernsey', 'Finland', 'Iceland', 'Egypt', 'Monaco', 'Peru',
       'Argentina', 'Qatar', 'Lebanon', 'St. Kitts and Nevis', 'Nigeria',
       'Tanzania', 'Ukraine', 'Slovakia', 'Venezuela'], dtype=object)

In [272]:
final_df.Country = final_df.Country.astype(str)

In [273]:
final_df['Country'].value_counts()

None             1386
United States     200
China             116
USA                67
Germany            45
                 ...
Malaysia            1
New Zealand         1
Oman                1
Swaziland           1
Monaco              1
Name: Country, Length: 65, dtype: int64

In [274]:
def clean_country (df):
    df['Country'] = df['Country'].str.replace('USA', 'United States')
    df['Country'] = df['Country'].str.replace("People's Republic of China", 'China')
    return df

In [275]:
clean_country(final_df)

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male
...,...,...,...,...,...,...,...,...
2203,2204,1.0 BUSD,Zhao,Zhao,51,"Fashion & Retail ==> fashion, entertainment",China,Not Available
2204,2205,1.0 BUSD,Zhou,Zhou,55,Manufacturing ==> electrical equipment,China,Male
2205,2206,1.0 BUSD,Zhu,Zhu,51,Manufacturing ==> electrical equipment,None,Male
2206,2207,1.0 BUSD,Zhuo,Zhuo,52,Manufacturing ==> printed circuit boards,Hong Kong,Female
2207,2208,1.0 BUSD,Olgun,Zorlu,54,Diversified ==> diversified,Turkey,Not Available

# WEB SCRP TOP10

In [276]:
import requests
!pip install BeautifulSoup4
!pip install lxml
from bs4 import BeautifulSoup
import pandas as pd

Requirement already satisfied: BeautifulSoup4 in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (4.8.2)
Requirement already satisfied: soupsieve>=1.2 in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (from BeautifulSoup4) (1.9.5)
Requirement already satisfied: lxml in /Users/Stefania/opt/anaconda3/envs/data_env/lib/python3.7/site-packages (4.4.2)

In [277]:
#Variables:
url = 'https://en.wikipedia.org/wiki/The_World%27s_Billionaires'
html = requests.get(url).content
soup = BeautifulSoup(html, "lxml")

In [278]:
def scr_top10 (url, html, soup):
    table = soup.find_all('table',{'class':'wikitable sortable'})[0]
    return table

In [279]:
table = scr_top10(url, html, soup)

In [280]:
def scr_table (table):
    rows = table.find_all('tr')
    rows_parsed = [row.text for row in rows]
    rows = [row.text.strip().split("\n") for row in rows]
    colnames = rows[0]
    for ele in colnames: 
        if ele == (''): 
            colnames.remove(ele) 
    data = rows[1:]
    top10_df = pd.DataFrame(data, columns=colnames)
    top10_df.drop(columns=['Name', 'Net worth (USD)','Age', 'Source(s) of wealth'], inplace=True)
    top10_df.rename(columns={"No.": "Position"}, inplace=True)
    
  
    return top10_df

In [281]:
top10_df = scr_table(table)
top10_df

  Position     Nationality
0       1    United States
1       2    United States
2       3    United States
3       4           France
4       5           Mexico
5       6            Spain
6       7    United States
7       8    United States
8       9    United States
9      10    United States

In [285]:
top10_df = top10_df.astype({"Position": int})

In [290]:
def merge1 (df1,df2):
    merged_df = pd.merge(df1, df2, on='Position', how='outer')
    return merged_df

In [294]:
merged_df = merge1(final_df, top10_df)

In [292]:
top10_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
Position       10 non-null int64
Nationality    10 non-null object
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

In [295]:
merged_df.head()

,Position,Worth,First Name,Lastname,Age,Source,Country,Gender_cat,Nationality
0,1,112.0 BUSD,Jeff,Bezos,54,Technology ==> Amazon,United States,Not Available,United States
1,2,90.0 BUSD,Bill,Gates,62,Technology ==> Microsoft,None,Male,United States
2,3,84.0 BUSD,Warren,Buffett,87,Finance and Investments ==> Berkshire Hathaway,None,Male,United States
3,4,72.0 BUSD,Bernard,Arnault,69,Fashion & Retail ==> LVMH,France,Male,France
4,5,71.0 BUSD,Mark,Zuckerberg,33,Technology ==> Facebook,United States,Male,Mexico